

# 입력받기
N, B = input().split()
B = int(B)

# 알파벳을 변환할 딕셔너리 생성
Alpa_dic = {'0' : 0, '1' : 1, '2' : 2, '3':3, '4' :4, '5':5, '6':6, '7':7,
            '8':8, '9' : 9,
            'A' : 10, 'B' : 11, 'C' : 12, 'D' :13, 'E' :14, 'F': 15, 'G':16,
            'H' : 17, 'I' : 18, 'J' : 19, 'K' :20, 'L' :21, 'M': 22, 'N':23,
            'O' : 24, 'P' : 25, 'Q' : 26, 'R' :27, 'S' :28, 'T': 29, 'U':30,
            'V' : 31, 'W' : 32, 'X' : 33, 'Y' :34, 'Z': 35}

# 문자의 순서대로 for문 진행
answer = 0
for i in range(len(N)) :
    # 해당 문자를 숫자로 변환한뒤, B의 알맞은 제곱과 곱함 -> answer 에 누적
    answer += Alpa_dic[N[i]] * (B**(len(N)-i-1))

print(answer)
