
# 입력받기
N, B = map(int, input().split())

# 몫이 0이 될 때까지 while문 진행
answer = []
now = N
while(1) :
    answer.append(str(now%B)) # 몫을 B로 나눈 나머지를 answer에 순서대로 저장

    now = now//B # 현재 값 갱신

    if now == 0:
        break

answer.reverse() # 순서 뒤집기


# 알파벳으로 변환할 딕셔너리 생성
Alpa_dic = {'0' : '0', '1' : '1', '2' : '2', '3':'3', '4' :'4', '5':'5', '6':'6', '7':'7',
            '8':'8', '9' : '9',
            '10' : 'A', '11' : 'B', '12' : 'C', '13' :'D', '14' :'E', '15': 'F', '16':'G',
            '17' : 'H', '18' : 'I', '19' : 'J', '20' :'K', '21' :'L', '22': 'M', '23':'N',
            '24' : 'O', '25' : 'P', '26' : 'Q', '27' :'R', '28' :'S', '29': 'T', '30':'U',
            '31' : 'V', '32' : 'W', '33' : 'X', '34' :'Y', '35': 'Z'}

# 딕셔너리에 맞게 출력
for i in range(len(answer)) :
    print(Alpa_dic[answer[i]], end="")


